app/views/users/show.html.erb

  <div class="span8">
    <% if @user.microposts.any? %>
---
SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["user_id", 101]]