app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Test"], ["created_at", Wed, 21 May 2014 15:18:34 UTC +00:00], ["updated_at", Wed, 21 May 2014 15:18:34 UTC +00:00], ["user_id", 101]]
---
   def create
	@micropost = current_user.microposts.build(params[:micropost])
	if @micropost.save