app/controllers/static_pages_controller.rb

  def home
      if signed_in?
	 @micropost = current_user.microposts.build
         @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0  [["user_id", 101]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 101]]